[
  {
    "title": "Streamlining Insolvency Professional Appointments: The IBBI’s 2025 Guidelines",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has introduced the “Insolvency Professionals to act as Interim Resolution Professionals, Liquidators, Resolution Professionals and Bankruptcy Trustees (Recommendation) Guidelines, 2025,” effective from July 1, 2025, to December 31, 2025. These guidelines aim to streamline the appointment process of Insolvency Professionals (IPs) by the National Company Law Tribunal (NCLT) and Debt Recovery Tribunal (DRT), ensuring a more efficient and transparent process for corporate and individual insolvency cases. They are issued under various sections of the Insolvency and Bankruptcy Code, 2016 (IBC) and related rules.</p>\n\n<p>To be included in the IP panel, candidates must meet specific eligibility criteria, including having no pending disciplinary proceedings, no convictions in the last three years, and holding a valid Authorization for Assignment (AFA). IPs must submit an expression of interest in Form A by June 22, 2025, specifying their consent to act in various roles and indicating their sector expertise.</p>\n\n<p>The IBBI will create a common panel of IPs, valid for six months, organized zone-wise and bench-wise. The sorting criteria for the panel prioritize IPs based on their volume of ongoing liquidation and corporate insolvency resolution assignments, with registration date serving as a tie-breaker. Appointed IPs are expected to accept assignments unless permitted otherwise by the NCLT, DRT, or IBBI; unjustified refusal will lead to removal from the panel for six months. The Adjudicating Authority retains the discretion to appoint any IP from the panel. These new guidelines, repealing the 2024 guidelines, are intended to improve the efficiency and fairness of IP appointments, thereby strengthening the IBC framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-2025-guidelines-insolvency-professional.jpg"
  },
  {
    "title": "FSSAI Issues Guidelines for Acceptance of Recycled PET as Food Contact Material",
    "description": "<p>On May 23, 2025, the Food Safety and Standards Authority of India (FSSAI) issued guidelines for the acceptance of recycled Polyethylene Terephthalate (PET) as Food Contact Material (FCM-rPET). This notification, under the Food Safety and Standards (Packaging) Regulations, 2018, aims to ensure recycled PET used in food packaging meets stringent safety and quality standards. The guidelines specifically address the recycling process of post-consumer PET used in food applications into FCM-rPET, focusing on technologies approved by FSSAI.</p>\n\n<p>The notification provides key definitions and mandates rigorous testing procedures, including Challenge, Extraction, and Migration Tests, conducted in accredited labs to ensure safety and quality. Detailed process requirements are specified to guarantee the purity and safety of recycled PET, with strict acceptance criteria for FCM-rPET resin.</p>\n\n<p>Moreover, the guidelines include specific marking and labelling requirements for materials made from FCM-rPET resin. Manufacturers, converters, beverage bottlers, food packers, and Food Business Operators (FBOs) must maintain relevant documentation, including a Declaration of Compliance and supply chain records. Manufacturers must also apply for authorization by submitting Form I, subject to an annual audit. Authorization or rejection is documented in Form II. Compliance with FSSAI criteria and regulations, including maintaining necessary documentation and test reports, is a condition for authorization.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/fssai-recycle-pet-food-contact-material.jpg"
  },
  {
    "title": "India Imposes Ban on Import and Transit of Goods from Pakistan",
    "description": "<p>On May 2, 2025, India's Directorate General of Foreign Trade (DGFT), under the Ministry of Commerce and Industry, issued a notification (06/2025-26) prohibiting the import and transit of all goods originating in or exported from Pakistan. This action, effective immediately, is implemented under the Foreign Trade Policy (FTP) 2023 via the insertion of Paragraph 2.20A. The move reflects the government's commitment to safeguarding national security and public policy.</p>\n\n<p>The notification, published in the Gazette of India, is legally grounded in Section 3 and Section 5 of the Foreign Trade (Development & Regulation) Act, 1992, and Paragraphs 1.02 and 2.01 of the FTP 2023. These provisions authorize the Central Government to regulate trade activities posing threats to national interests. The ban applies comprehensively to all goods, irrespective of existing trade regulations.</p>\n\n<p>This prohibition underscores the government's determination to protect national security and uphold public policy. Potential exceptions to the ban require prior approval from the Government of India, ensuring careful scrutiny and justification. The implications of this notification are significant, impacting trade relations between India and Pakistan and potentially affecting sectors reliant on imports from Pakistan. Businesses may need to seek alternative sources and re-evaluate trade strategies.</p>\n\n<p>In conclusion, this notification signifies a decisive step in regulating trade activities with Pakistan, invoking specific legal provisions and prioritizing national security and public policy. While the ban remains in effect until further notice, it demonstrates the government's firm stance on trade and security matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/india-ban-import-transit-goods-pakistan.jpg"
  },
  {
    "title": "High Court of Punjab and Haryana: Proportionality in Punishment is Key in Disciplinary Actions",
    "description": "<p>The High Court of Punjab and Haryana has emphasized the importance of proportionality in disciplinary actions by reducing the punishment of a police officer penalized for a single day's absence from duty. The case, *Satyaveer Singh vs State of Haryana and others*, underscores the court's commitment to ensuring punishments are commensurate with the offenses committed.</p>\n\n<p>The petitioner, Satyaveer Singh, was initially dismissed from the Haryana Police Force for being absent from duty for approximately 24 hours. While the appellate authority reduced the dismissal to forfeiture of 10 annual increments, the High Court found this punishment disproportionate. The petitioner argued that the appellate and revisionary authorities acted without properly considering the proportionality of the punishment.</p>\n\n<p>Relying on Rule 16.2 of the Punjab Police Rules, 1934, and Supreme Court judgments like *Om Kumar v. Union of India* and *Bhagat Ram v. State of Himachal Pradesh*, the court emphasized that disproportionate punishment violates Article 14 of the Constitution of India. The court noted the authorities had acted mechanically in upholding a punishment that was excessive for a single day's absence.</p>\n\n<p>To avoid further litigation after 10 years, the High Court opted not to remand the case. Instead, the court reduced the punishment to forfeiture of one increment with cumulative effect, highlighting the necessity of adhering to the principle of proportionality in all disciplinary actions.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/high-court-of-punjab-and-haryana-proportionality-in-punishment-is-key-in-disciplinary-actions.jpg"
  },
  {
    "title": "Karnataka Enacts Groundbreaking Ordinance For Gig Worker Welfare",
    "description": "<p>The Karnataka Platform Based Gig Workers (Social Security and Welfare) Ordinance, 2025, represents a pioneering policy initiative by the Government of Karnataka aimed at regulating the burgeoning gig economy. The ordinance seeks to establish a legal framework that safeguards the rights of platform-based gig workers, defines the obligations of aggregators and digital platforms operating within the state, and ensures access to social security and welfare benefits.</p>\n\n<p>The legislation applies to aggregators and platforms offering services listed in the ordinance's schedule and to all gig workers registered with the Welfare Board. It addresses key aspects such as social security, occupational health and safety, transparency in automated monitoring systems, and effective dispute resolution mechanisms. A \"gig worker\" is defined as someone performing work based on a contract with a specified payment rate through a digital platform, while \"platforms\" are digital arrangements used to assign tasks. Social security includes benefits like healthcare and income support during unemployment, illness, or disability, funded by a welfare fee ranging from 1% to 5% of a worker's payout, levied on platforms.</p>\n\n<p>A dedicated Karnataka Platform Based Gig Workers Welfare Board, comprising government officials, worker and aggregator representatives, civil society members, and experts, will administer the ordinance. This Board, headquartered in Bengaluru, will act as a statutory body with the authority to manage assets, enter contracts, and pursue legal action.</p>\n\n<p>Platforms must register with the Board within 45 days and regularly update their worker database. They are obligated to provide fair contracts with clear terms on work rates and performance evaluations, communicating any changes in advance. Furthermore, platforms must ensure their automated monitoring systems are non-discriminatory, providing workers with information about how algorithms affect assignments, ratings, and earnings.</p>\n\n<p>The ordinance establishes a Karnataka Gig Workers Social Security and Welfare Fund, managed by the Board and financed through welfare fees, voluntary worker contributions, and government grants. This fund will be subject to annual audits by the State's Accountant General, and a Payment and Welfare Fee Verification System (PWFVS) will monitor payouts. Non-compliance, such as failure to register or delays in fee payments, will result in penalties. The State Government is authorized to issue rules for enforcement, and the Board is empowered to investigate complaints.</p>\n\n<p>This ordinance marks a significant step towards recognizing gig workers as a distinct category of labor entitled to social protection. By establishing a comprehensive legal framework, Karnataka has set a national precedent, providing a model for other states and the central government to follow in protecting the rights and dignity of workers in the expanding gig economy.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/karnataka-groundbreaking-gig-worker.jpg"
  },
  {
    "title": "CDSCO Clarifies Permissions for Overprinting and Labelling of Imported Drugs",
    "description": "<p>The Directorate General of Health Services and the Central Drugs Standard Control Organization (CDSCO) issued an Office Memorandum on May 26, 2025, clarifying the comprehensive permission for importing drugs intended for labelling, overprinting, and stickering under Rule 104A of the Drugs and Cosmetics Rules, 1945. This memorandum builds upon an earlier directive from January 29, 2020, and outlines specific requirements and conditions for these activities.</p>\n\n<p>The memorandum emphasizes that alterations to drug labels are permissible only with the Licensing Authority's approval, as outlined in Rule 104A. This clarification addresses the conditions under which these alterations are allowed, specifically for imported drugs. The issuing authority is the Drugs Controller General (India), and the document aims to ensure compliance with the Drugs and Cosmetics Rules, 1945, while facilitating the import of drugs for necessary labelling purposes.</p>\n\n<p>Importing drugs for labelling, overprinting, or stickering is strictly limited to entities holding a valid manufacturing license. Licensees must possess adequate storage and labelling facilities, along with at least one qualified manufacturing and QA personnel, as determined by the State Licensing Authority (SLA). While a QC Laboratory and personnel are not mandatory, qualified staff are essential to ensure adherence to regulatory standards during the labelling process. Compliance with current Drugs and Cosmetics Rules is mandatory, with the original label remaining visible and the License number and activity clearly indicated. For instance, a drug intended for CGHS supply should include \"CGHS Supply Overprint\" on its label, ensuring transparency and accurate reflection of the drug's intended use.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/cdsco-104a-drugs-cosmetics-rules-1945.jpg"
  },
  {
    "title": "Navigating the Roadmap for DPDP Compliance: What Companies Need to Start On",
    "description": "<p>The release of the draft Digital Personal Data Protection Rules (DPDP) 2025 signals a critical shift towards strengthened digital privacy in India. To align with this evolving regulatory environment, organizations should proactively update their data governance frameworks and demonstrate a commitment to robust data protection. This not only ensures compliance but also cultivates trust with customers in an increasingly privacy-conscious market, differentiating businesses through best practices in data security and privacy.</p>\n\n<p>The DPDP Act introduces key principles such as accountability, transparency, data minimization, and proactive risk management. Organizations must take responsibility for the data they process, communicate clearly with data principals about data usage, collect only necessary data, and regularly assess data processing activities and security measures. These principles necessitate a strategic rethink of existing data handling practices.</p>\n\n<p>Companies should begin by performing a gap assessment to identify discrepancies between current processes and DPDP Act requirements. This includes determining the organization's applicability to the Act and specific obligations as a data fiduciary or data processor. Prioritizing tasks with immediate external implications is crucial, such as implementing consent management compliant with the DPDPA, providing clear notice and DPO contact information, ensuring easy consent withdrawal, and maintaining consent logs.</p>\n\n<p>Enhancing data security is vital for DPDP compliance, requiring advanced data governance measures, robust data protection strategies, and adherence to data minimization and secure processing principles. Implementing encryption, access controls, regular security audits, and monitoring data access are essential technical and organizational measures. Internal tasks include data mapping and inventory to understand data processing activities, establishing data lifecycle management practices, and appointing a Data Protection Officer (DPO), especially for Significant Data Fiduciaries (SDFs).</p>\n\n<p>Strategic recommendations include establishing a robust incident response plan with triage and documentation systems, assigning specific roles, and conducting periodic breach simulations. Developing customizable breach notification templates and fostering cross-departmental collaboration between IT, legal, and compliance teams streamline breach management. Investing in state-of-the-art verification technologies and integrating with government-issued services is also essential, alongside public awareness campaigns to enhance transparency and trust.</p>\n\n<p>While the finalization and implementation of the DPDP Rules may still be pending, they represent a significant advancement in India’s data protection landscape. Compliance involves fostering trust in the data-driven economy, mitigating data privacy risks, and proactively adapting strategies to ensure the protection of personal data and the rights of data principals. This journey requires a structured approach, proactive engagement, and a commitment to continuous improvement.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/dpdp-compliance-companies-need-start-on.jpg"
  },
  {
    "title": "CCPA Issues Guidelines to Regulate Radio Equipment Sales on E-Commerce Platforms",
    "description": "<p>The Central Consumer Protection Authority (CCPA) has introduced new guidelines, “Guidelines for the Prevention and Regulation of Illegal Listing and Sale of Radio Equipment including Walkie-Talkies on E-Commerce Platforms, 2025,” to regulate the sale of radio equipment, including walkie-talkies, on e-commerce platforms. These guidelines aim to ensure compliance with national telecommunications and security regulations, protecting consumers and maintaining regulatory standards by preventing the unauthorized sale and distribution of wireless telegraphy apparatuses. The guidelines are enforceable under Section 18 of the Consumer Protection Act, 2019.</p>\n\n<p>The guidelines apply to all e-commerce platforms operating in or catering to Indian consumers, as well as manufacturers, importers, and sellers of radio equipment, including walkie-talkies and other wireless devices requiring specific authorization. They prohibit the listing or sale of radio equipment requiring frequency assignment from the Department of Telecommunications (DOT) unless purchased from an authorized dealer, and ban the listing of mobile signal boosters and wireless jammers.</p>\n\n<p>To ensure compliance, product listings must specify frequency ranges and technical parameters, and include proof of regulatory approval, such as Equipment Type Approval (ETA). Platforms are required to implement automated scanning systems to detect non-compliant listings and provide a user-friendly reporting mechanism for the public. Online platforms must certify the authenticity of test reports for license-exempt equipment and remove non-compliant listings within 24 hours of receiving directions from the Department of Consumer Affairs (DoCA) or DOT. Regular audits and compliance reports are also mandatory.</p>\n\n<p>Non-compliance will result in penalties under the Consumer Protection Act, 2019, and other applicable laws, including blacklisting of sellers and potential liabilities for platforms. E-commerce platforms are expected to collaborate with regulatory authorities for real-time takedowns and enforcement actions, as well as submit regular compliance reports. Platforms are also required to display notices regarding the risks and legal implications of purchasing unauthorized walkie-talkies to educate consumers.</p>\n\n<p>In conclusion, these guidelines represent a comprehensive regulatory framework designed to protect consumers, maintain national security standards, and prevent the unauthorized sale and use of wireless equipment on e-commerce platforms through clear compliance requirements, monitoring systems, and public awareness initiatives.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ccpa-radio-equipment-ecommerce-platform.jpg"
  },
  {
    "title": "FSSAI Advisory: Discontinuation of the Term “100%” on Food Product Labels and Promotional Materials",
    "description": "<p>The Food Safety and Standards Authority of India (FSSAI) issued an advisory on May 28, 2025, addressing the use of the term \"100%\" on food product labels and promotional materials, citing potential misleading implications. This action aims to enforce compliance with existing regulations and protect consumers from ambiguous and deceptive marketing claims.</p>\n\n<p>The FSSAI observed an increase in the use of \"100%\" in food marketing, which it deems misleading due to its ambiguity and the potential to convey a false sense of absolute purity or superiority over competing products. This prompted regulatory action under the Food Safety and Standards Act, 2006, and the Food Safety and Standards (Advertising and Claims) Regulations, 2018.</p>\n\n<p>Referencing regulations prohibiting misleading claims and mandating truthful and unambiguous information, the FSSAI advises all Food Business Operators (FBOs) to cease using \"100%\" on food product labels, packaging, and promotional content. The term lacks definition within the FSS Act, 2006, potentially causing consumer confusion.</p>\n\n<p>This advisory underscores the FSSAI's commitment to food safety and consumer protection. Discontinuing the use of \"100%\" prevents misleading claims and ensures transparency and accuracy in marketing practices. FBOs are advised to comply to avoid regulatory violations and maintain product and marketing integrity.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/discontinuation-100-food-product-labels.jpg"
  },
  {
    "title": "Delhi High Court Terminates Arbitrator's Mandate Due to Unexplained Delay",
    "description": "<p>The Delhi High Court, in *Great Eastern Energy Corporation Limited vs Sopan Projects*, terminated a Sole Arbitrator's mandate due to an unexplained delay of over eight years in delivering the arbitral award. This ruling underscores the importance of timely dispute resolution within arbitration and reinforces the court's dedication to the principles of the Arbitration and Conciliation Act, 1996.</p>\n\n<p>The dispute stemmed from a 2010 Work Order where Great Eastern Energy Corporation Limited (Petitioner) contracted Sopan Projects (Respondent) for the construction of an underground MDPE pipeline. After revisions to the project, the Respondent allegedly abandoned the work, leading to the invocation of arbitration by the Respondent in 2015. The arbitration proceedings concluded in March 2020, however, no award was delivered.</p>\n\n<p>The Petitioner argued that the excessive delay was against public policy. The Respondent countered that the Petitioner had not paid the outstanding arbitrator's fee, and that the delay should account for the time excluded under the Supreme Court’s order in Suo Moto Writ Petition (C) No.3/2020, and that the Petitioner failed to follow up with the arbitrator during the delay period.</p>\n\n<p>The High Court, referencing Section 14 of the Arbitration and Conciliation Act, 1996, and various Supreme Court judgments, found that the unexplained three-year delay justified the termination. The Court emphasized the significance of swift arbitration proceedings and underscored that the Petitioner was not obligated to solicit explanations from the arbitrator before seeking judicial intervention. The decision reinforces the necessity of efficient arbitration proceedings aligning with the objectives of the Arbitration and Conciliation Act, 1996.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/delhi-hc-terminate-arbitrators-mandate-delay.jpg"
  },
  {
    "title": "Environmental Impact of Pharmaceutical Waste: Review of CDSCO Guidance on Disposal of Expired/Unused Drugs",
    "description": "<p>The Director General of Health Services, CDSCO, issued a guidance document on May 26, 2025, outlining the safe and responsible disposal of expired and unused medicines. Prompted by research highlighting ecological risks, the document, a result of the 58th Drugs Consultative Committee (DCC) discussions, aims to mitigate environmental and public health hazards associated with improper pharmaceutical waste disposal.</p>\n\n<p>The document emphasizes preventing water contamination, misuse of expired drugs, and adverse drug reactions, including addressing antimicrobial resistance (AMR). Its primary objective is to provide clear instructions for compliance with the Drugs and Cosmetics Act and Rules, minimizing environmental impact and public health risks.</p>\n\n<p>The guidance details various disposal methods, including landfill (utilizing engineered sites), waste immobilization through encapsulation and inertization, and sewer disposal for specific liquid pharmaceuticals. It discourages open burning and recommends medium-to-high-temperature incineration or chemical decomposition when incineration is unavailable. The document aligns with the Bio-Medical Waste (Management and Handling) Rules, 2016, clarifying stakeholder responsibilities.</p>\n\n<p>Specific procedures are outlined for retailers, wholesalers, manufacturers, hospitals, and government agencies, requiring them to return expired/unused drugs to manufacturers or dispose of them according to guidelines, while maintaining detailed records. Collection, storage (in yellow non-chlorinated bags/containers), and transportation procedures for various drug types, including cytotoxic, radioactive, and controlled substances, are also detailed.</p>\n\n<p>For the general public, the document suggests establishing \"Drug take back\" sites and provides a list of medicines suitable for flushing down toilets to prevent accidental ingestion or misuse. Adherence to these guidelines is crucial for reducing environmental impact and safeguarding public health by ensuring the safe disposal of expired and unused pharmaceuticals.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/environment-impact-pharmaceutical-waste.jpg"
  },
  {
    "title": "The Insolvency and Bankruptcy Board of India notifies IBBI (Insolvency Resolution Process for Corporate Persons) (Fourth Amendment) Regulations, 2025",
    "description": "<p>The Insolvency and Bankruptcy Board of India (IBBI) has announced the Fourth Amendment Regulations to the Insolvency Resolution Process for Corporate Persons, effective May 26, 2025. These amendments are designed to improve the efficiency and transparency of corporate insolvency resolution processes, under the powers conferred by the Insolvency and Bankruptcy Code, 2016.</p>\n\n<p>A key change involves Regulation 18, with the addition of a provision allowing the committee of creditors to invite interim finance providers as observers to committee meetings, without voting rights. This aims to provide valuable financial insights and facilitate smoother financial arrangements during the resolution process.</p>\n\n<p>Regulation 36A has been updated to allow resolution professionals, with committee approval, to invite expressions of interest for resolution plans that can address the corporate debtor as a whole or through the sale of individual assets, increasing the potential for attracting diverse investors and solutions.</p>\n\n<p>Further, Regulation 38 has been amended to ensure financial creditors who did not support a resolution plan are still paid proportionately and prioritized over supporting creditors, ensuring equitable treatment for all financial creditors. Additionally, amendments to Regulation 39 clarify compliance requirements, ensuring all resolution plans meet necessary standards for a more robust process.</p>\n\n<p>In summary, the Fourth Amendment Regulations represent a significant enhancement to the corporate insolvency resolution process. These changes aim to ensure fairness, transparency, and efficiency, ultimately benefiting corporate debtors, creditors, and the overall economy by improving the insolvency resolution framework.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/ibbi-fourth-amendment-regulations-2025.jpg"
  },
  {
    "title": "Bail is the Rule, Jail is the Exception — State of Rajasthan v. Balchand alias Baliay (1977)",
    "description": "<p>In <b>State of Rajasthan v. Balchand alias Baliay (1977)</b>, the Supreme Court of India, led by Justice <b>V.R. Krishna Iyer</b>, affirmed the principle that <b>bail is the rule and jail is the exception</b>.</p>\n\n<p>The accused, <b>Balchand alias Baliay</b>, was convicted of housebreaking and theft under <b>Sections 457</b> and <b>380</b> of the <b>Indian Penal Code</b>. During his appeal against the conviction, he was granted interim bail, which the <b>State of Rajasthan</b> challenged on the grounds that a conviction extinguishes the presumption of innocence.</p>\n\n<p>The Court considered whether a conviction automatically deprives an accused of the right to bail pending appeal, and how to balance <b>societal security</b> with an individual’s <b>fundamental liberty</b>. The prosecution contended that conviction nullifies the presumption of innocence and mandates bail cancellation, while the defense argued that the appeal process is an extension of the trial and preserves the accused’s right to liberty until final judgment.</p>\n\n<p>Justice Krishna Iyer’s judgment emphasized that the <b>presumption of innocence</b> endures until all appellate remedies are exhausted. He underscored that under <b>Article 21</b> of the Constitution, personal liberty must be deprived only through a process that is just, fair, and reasonable. The Court held that “<b>bail is the rule</b>” and that bail may be denied only in exceptional circumstances such as flight risk, tampering with evidence, or threat to public order. It ruled that bail cannot be revoked automatically upon conviction, but must be assessed on a case-by-case basis, ensuring the justice system protects both liberty and public interest.</p>\n\n<p>This ruling established the foundation of modern <b>bail jurisprudence</b> in India, affirming that even a convicted person retains dignity and the right to judicial review. It has guided subsequent judgments to resist mechanical denials of bail and reinforced that restrictions on liberty must be grounded in substantial reasons.</p>\n\n<p>In simple terms, the decision balances <b>personal freedom</b> and <b>public safety</b>, favoring release unless compelling reasons demand custody. As Justice Krishna Iyer eloquently stated: “<b>Bail is the rule and jail is the exception.</b>”</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Bail is the Rule, Jail is the Exception.jpg"
  },
  {
    "title": "Commander K.M. Nanavati vs. State of Maharashtra (1959) — A Landmark Case in Indian Legal History",
    "description": "<p>The case of <b>Commander K.M. Nanavati v. State of Maharashtra</b> (1959) remains one of the most significant criminal trials in Indian jurisprudence, fundamentally altering perceptions of jury trials and the defense of provocation.</p>\n\n<p>Commander Kawas Manekshaw Nanavati, a distinguished officer of the Indian Navy, lived in Mumbai with his wife Sylvia and their children. When Sylvia’s extramarital affair with Prem Ahuja, a wealthy businessman, came to light, Nanavati confronted them. In an emotionally charged encounter, he took his service revolver and went to Prem Ahuja’s residence, where he fatally shot him.</p>\n\n<p>Key legal questions arose: whether Nanavati’s act amounted to murder under <b>Section 302 of the Indian Penal Code (IPC)</b>, and whether it could be reduced to culpable homicide not amounting to murder under <b>Exception 1 to Section 300 IPC</b> for grave and sudden provocation.</p>\n\n<p>At the Bombay Sessions Court, a jury trial returned a “Not Guilty” verdict by 8:1. The Sessions Judge, deeming the jury’s decision perverse and influenced by media sympathy, referred the case to the Bombay High Court under <b>Section 307 of the Code of Criminal Procedure</b>. The High Court reversed the jury’s verdict, finding Nanavati guilty of murder—a conviction later upheld by the Supreme Court of India.</p>\n\n<p>The courts examined whether provocation was truly sudden and overwhelming. Finding that Nanavati had time to plan—retrieving his revolver and traveling to Ahuja’s home—the defense of sudden provocation was rejected. The case also exposed media influence on juries, leading to the abolition of jury trials in Indian criminal law during the 1960s.</p>\n\n<p>Nanavati served his sentence but was subsequently pardoned by the Governor of Maharashtra after significant public and political support. His story inspired numerous films, books, and debates, most famously the Bollywood movie <b>Rustom</b>.</p>\n\n<p>The <b>Nanavati case</b> stands as a milestone in Indian criminal law, clarifying the limits of the provocation defense, highlighting the vulnerabilities of jury-based trials, and prompting the end of the jury system in India.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Commander K.M. Nanavati vs. State of Maharashtra (1959).jpg"
  },
  {
    "title": "Cheque Bounce Recovery in India: Your Legal Options Explained",
    "description": "<p>In India, a <b>cheque bounce</b>, technically known as <b>dishonor of cheque</b>, is a criminal offense punishable under Section 138 of the <b>Negotiable Instruments Act, 1881</b>. This happens when a bank refuses to honor a cheque due to insufficient funds in the drawer's account, or for other reasons like signature mismatch. For an ordinary citizen, receiving a bounced cheque can be a frustrating experience, but it's crucial to understand the legal options available to recover the owed amount.</p>\n\n<p>The process for <b>cheque bounce recovery</b> begins with sending a legal notice to the issuer of the cheque. This notice must be sent within 30 days from the date the bank informs you about the dishonor of the cheque. The notice should demand payment of the cheque amount within 15 days. If the issuer fails to make the payment within this period, you have the right to file a criminal complaint in the court of a Metropolitan Magistrate or a Judicial Magistrate of the First Class, within one month from the date of expiry of the 15-day notice period. This initiates legal proceedings under Section 138 of the <b>Negotiable Instruments Act</b>.</p>\n\n<p>A critical aspect of the <b>Section 138</b> case is establishing that the debt or liability exists. The onus is on the complainant to prove that the cheque was issued in discharge of a legally enforceable debt or other liability. The drawer of the cheque has the opportunity to defend themselves, and the court will consider both sides before delivering a judgment. If the court finds the accused guilty, they can be sentenced to imprisonment for a term which may extend to two years, or with a fine which may extend to twice the amount of the cheque, or with both.</p>\n\n<p>Beyond the criminal proceedings under Section 138, it's also possible to initiate a civil suit for recovery of money. While the criminal case aims to penalize the defaulter, a civil suit aims to recover the outstanding amount along with interest and other costs. Filing a civil suit doesn't preclude initiating criminal proceedings, and both can proceed simultaneously. The legal recourse available to an individual who receives a <b>bounced cheque</b> provides substantial protection, ensuring that financial transactions are honored and that remedies are available when defaults occur.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Cheque-Bounce-Recovery-in-India-Your-Legal-Options-Explained.jpg"
  },
  {
    "title": "Indian Landlord Rights: Eviction Rules You Need to Know",
    "description": "<p>In India, landlords have specific rights when it comes to evicting a tenant, governed primarily by the respective state's <b>Rent Control Act</b>. These Acts vary across states, but generally, a landlord cannot evict a tenant at will. A valid and legal ground for eviction must exist, such as non-payment of rent, causing nuisance, subletting without permission, or using the property for illegal activities. It's crucial for landlords to understand the specific provisions of the Rent Control Act applicable in their state to ensure any eviction process complies with the law.</p>\n\n<p>The process of eviction typically involves serving a legal notice to the tenant, clearly stating the reason for eviction and giving them a reasonable timeframe to vacate the premises. If the tenant fails to comply, the landlord can then file an eviction suit in the appropriate court. The court will then hear both sides of the argument, examining the evidence presented by both the landlord and the tenant. The burden of proof usually lies with the landlord to demonstrate that a valid ground for eviction exists under the relevant <b>Rent Control Act</b>. Landlords must keep accurate records of rent payments, communication with the tenant, and any violations of the rental agreement to support their case.</p>\n\n<p>It's important to note that even with a valid reason for eviction, a landlord cannot use force or illegal means to evict a tenant. Such actions can result in legal repercussions for the landlord, including penalties and damages. The eviction process must be carried out through the court, obtaining a court order for eviction if necessary. The Supreme Court has repeatedly emphasized the importance of following due process of law in eviction matters. For example, the landmark case of *Raghunath G. Panhale (Dead) By Lrs. v. M/S. Chaganlal Sundarji And Co* highlighted the need for strict adherence to procedural laws in eviction proceedings.</p>\n\n<p>For ordinary citizens who are landlords, understanding these <b>eviction rules</b> is crucial for protecting their property rights while also acting within the bounds of the law. Seeking legal advice from a lawyer specializing in property law is highly recommended before initiating any eviction proceedings. This ensures compliance with the state's specific Rent Control Act and minimizes the risk of legal complications. Moreover, familiarizing oneself with relevant case laws can provide a better understanding of how courts interpret and apply these laws in practice. Remember that a fair and legal eviction process protects both the landlord's rights and the tenant's rights, promoting a more equitable rental relationship.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Indian-Landlord-Rights-Eviction-Rules-You-Need-to-Know.jpg"
  },
  {
    "title": "Online Fraud Refund: Your Rights Under Indian Law",
    "description": "<p>If you've fallen victim to <b>online fraud</b> in India, knowing your rights concerning a <b>refund</b> is crucial. Indian law provides avenues for recovering lost funds, though the process can sometimes be complex. The primary legislation governing such issues is the <b>Information Technology Act, 2000</b>, which addresses cybercrimes and provides a framework for holding fraudsters accountable. Banks and payment service providers also have a responsibility to ensure secure transactions, and their negligence can lead to liability.</p>\n\n<p>The liability of banks in cases of <b>unauthorized electronic transactions</b> is often governed by the Reserve Bank of India (RBI) guidelines. These guidelines typically differentiate liability based on customer reporting timelines. If the customer reports the fraudulent transaction promptly (usually within 3 days), the liability is often limited or even zero. Delay in reporting can increase the customer's potential liability. Banks are required to have a robust dispute resolution mechanism to handle customer complaints regarding fraudulent transactions and provide a refund, if warranted. It is important to document all communications with the bank and file a formal complaint with evidence of the <b>fraudulent transaction</b>.</p>\n\n<p>Beyond banking regulations, Section 43 of the <b>IT Act</b> deals with compensation for damages caused to computer systems and networks due to unauthorized access or disruption. While it may not directly guarantee a <b>refund</b>, it allows for claiming damages. Furthermore, depending on the nature of the <b>online fraud</b>, the Indian Penal Code (IPC) provisions related to cheating, forgery, and criminal breach of trust can also be invoked. Registering a First Information Report (FIR) with the police is a crucial step in initiating a criminal investigation and strengthens your case for seeking legal remedies.</p>\n\n<p>For ordinary citizens, the practical implication is to be vigilant and proactive. Immediately report any <b>online fraud</b> to your bank and the cybercrime cell. Keep records of all transactions and communication. File a police complaint to initiate formal investigation. Familiarizing yourself with RBI guidelines on limiting liability in fraudulent transactions can greatly help navigate the process of claiming a <b>refund</b>. Remember, acting quickly and diligently is essential to maximizing your chances of recovering your funds.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Online-Fraud-Refund-Your-Rights-Under-Indian-Law.jpg"
  },
  {
    "title": "Live-in Relationships in India: Know Your Legal Rights",
    "description": "<p>In India, a <b>live-in relationship</b> refers to an arrangement where two individuals choose to cohabit and share their lives together without being legally married. This form of relationship has gained increasing social acceptance, and the Indian legal system has gradually recognized certain rights and protections for couples in such arrangements. However, it's crucial to understand that live-in relationships don't automatically grant the same rights as a marriage. Proof of a relationship resembling marriage, including factors like duration, shared household, pooling of resources, and intent to marry, is often essential for claiming legal entitlements.</p>\n\n<p>Several landmark court judgments have shaped the legal landscape surrounding live-in relationships. The Supreme Court, in cases like D. Patchaiammal v. D. Velusamy, has laid down guidelines for determining the validity and nature of a live-in relationship. To be considered a valid relationship warranting legal protection, the couple must hold themselves out to society as being akin to spouses. Importantly, not all cohabitation qualifies as a live-in relationship entitled to legal rights. The court has emphasized the necessity of a long-standing and genuine relationship similar to marriage. These judicial pronouncements primarily aim to prevent exploitation and protect vulnerable partners within such arrangements.</p>\n\n<p>The legal implications for women in <b>live-in relationships</b> are particularly significant. While not explicitly covered under the Hindu Marriage Act, certain legislations like the Protection of Women from Domestic Violence Act, 2005, provide some recourse. This Act recognizes women in live-in relationships as being in a relationship \"in the nature of marriage,\" thereby entitling them to protection from domestic violence, including physical, emotional, and economic abuse. They can seek remedies such as residence orders, monetary relief, and protection orders under this Act. Further, children born out of live-in relationships are considered legitimate and have inheritance rights in their parents’ property, as established by various court decisions.</p>\n\n<p>It’s important to note that establishing legal rights within a <b>live-in relationship</b> can often be challenging. Unlike a formal marriage certificate, there's no single document that automatically proves the existence of the relationship or its nature. Individuals need to gather evidence, such as joint bank accounts, utility bills with both names, photographs, and testimonies of friends and family, to demonstrate the validity and characteristics of their relationship to the court. Seeking legal advice from a qualified lawyer is highly recommended for individuals in live-in relationships to understand their rights and obligations and to navigate the legal complexities effectively. This is especially crucial in cases involving property disputes, maintenance claims, or inheritance matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Live-in-Relationships-in-India-Know-Your-Legal-Rights.jpg"
  },
  {
    "title": "Supreme Court Imposes Year-Long Firecracker Ban in Delhi-NCR",
    "description": "<p>The Supreme Court has imposed a comprehensive, year-long ban on the use, manufacture, sale, and storage of firecrackers in the Delhi-National Capital Region (NCR). This decision extends beyond the previous 3-4 month restrictions, aiming to address the region's persistent air quality issues.</p><p>The Court emphasized that the prevailing air pollution levels in Delhi-NCR necessitate stringent measures. Consequently, no exceptions will be made, including for 'green crackers,' which are only marginally less polluting than traditional ones. The ban also encompasses online sales of firecrackers.</p><p>In its ruling, the Court underscored the fundamental right to health under Article 21 of the Constitution, highlighting the adverse effects of air pollution on citizens' well-being. The bench stated that no religious practices advocate for activities that harm the environment or public health.</p><p>This landmark judgment reflects the judiciary's commitment to ensuring a cleaner environment and safeguarding public health in the face of escalating pollution concerns in the capital region.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme%20Court%20Imposes%20Year-Long%20Firecracker%20Ban%20in%20Delhi-NCR.jpg"
  },
  {
    "title": "Supreme Court Affirms State Commissions' Authority Over Inter-State Power Supply Affecting State Grids",
    "description": "<p>The Supreme Court has clarified that State Electricity Regulatory Commissions (SERCs) retain the authority to regulate open access to electricity transmission within their states, even when it involves inter-state power supply, if such transactions impact the state's grid.</p><p>While the Central Electricity Regulatory Commission (CERC) oversees inter-state electricity transmission under Section 79(1)(c) of the Electricity Act, 2003, this does not preclude SERCs from exercising jurisdiction over intra-state aspects of open access. Specifically, Section 42(2) empowers SERCs to ensure fair and non-discriminatory access to transmission and distribution networks within their respective states.</p><p>This ruling underscores the collaborative regulatory framework envisioned by the Electricity Act, 2003, balancing the roles of both central and state commissions in managing the nation's electricity infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Affirms-State-Commissions-Authority-Over-Inter-State-Power-Supply-Affecting-State-Grid.jpg"
  },
  {
    "title": "Supreme Court: S-138 NI Act Complainant Not Required to Prove Financial Capacity at Threshold",
    "description": "<p>The Supreme Court has clarified that under Section 138 of the Negotiable Instruments Act, a complainant is not required to prove their financial capacity at the initial stage of the proceedings. This decision emphasizes that the focus should be on the alleged offense rather than the economic standing of the complainant.</p><p>In its ruling, the Court noted that the procedural threshold is meant to ensure that valid complaints are heard without undue burden on the complainant, thereby upholding the principles of accessible justice. This approach reinforces the idea that the legitimacy of the complaint does not hinge on the complainant’s ability to demonstrate financial robustness.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-S-138-NI-Act-Complainant-Not-Required-to-Prove-Financial-Capacity-at-Threshold.jpg"
  },
  {
    "title": "Supreme Court Upholds Cancellation of 25,753 West Bengal SSC Appointments",
    "description": "<p>The Supreme Court has upheld the Calcutta High Court's decision to invalidate approximately 25,753 teaching and non-teaching staff appointments made by the West Bengal School Service Commission (SSC) in 2016.</p><p>The Court found that the selection process was marred by widespread fraud and manipulation, rendering it irreparably tainted. Consequently, the services of the affected candidates are to be terminated, and they are required to refund any salaries received.</p><p>This ruling underscores the judiciary's commitment to maintaining integrity and transparency in public recruitment processes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Upholds-Cancellation-of-25-753-West-Bengal-SSC-Appointments.jpg"
  },
  {
    "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
    "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered.</p>  <p>The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment.</p>  <p>In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired.</p>  <p>This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.jpg"
  }
]