[
  {
    "title": "Live-in Relationships in India: Know Your Legal Rights",
    "description": "<p>In India, a <b>live-in relationship</b> refers to an arrangement where two individuals choose to cohabit and share their lives together without being legally married. This form of relationship has gained increasing social acceptance, and the Indian legal system has gradually recognized certain rights and protections for couples in such arrangements. However, it's crucial to understand that live-in relationships don't automatically grant the same rights as a marriage. Proof of a relationship resembling marriage, including factors like duration, shared household, pooling of resources, and intent to marry, is often essential for claiming legal entitlements.</p>\n\n<p>Several landmark court judgments have shaped the legal landscape surrounding live-in relationships. The Supreme Court, in cases like D. Patchaiammal v. D. Velusamy, has laid down guidelines for determining the validity and nature of a live-in relationship. To be considered a valid relationship warranting legal protection, the couple must hold themselves out to society as being akin to spouses. Importantly, not all cohabitation qualifies as a live-in relationship entitled to legal rights. The court has emphasized the necessity of a long-standing and genuine relationship similar to marriage. These judicial pronouncements primarily aim to prevent exploitation and protect vulnerable partners within such arrangements.</p>\n\n<p>The legal implications for women in <b>live-in relationships</b> are particularly significant. While not explicitly covered under the Hindu Marriage Act, certain legislations like the Protection of Women from Domestic Violence Act, 2005, provide some recourse. This Act recognizes women in live-in relationships as being in a relationship \"in the nature of marriage,\" thereby entitling them to protection from domestic violence, including physical, emotional, and economic abuse. They can seek remedies such as residence orders, monetary relief, and protection orders under this Act. Further, children born out of live-in relationships are considered legitimate and have inheritance rights in their parents’ property, as established by various court decisions.</p>\n\n<p>It’s important to note that establishing legal rights within a <b>live-in relationship</b> can often be challenging. Unlike a formal marriage certificate, there's no single document that automatically proves the existence of the relationship or its nature. Individuals need to gather evidence, such as joint bank accounts, utility bills with both names, photographs, and testimonies of friends and family, to demonstrate the validity and characteristics of their relationship to the court. Seeking legal advice from a qualified lawyer is highly recommended for individuals in live-in relationships to understand their rights and obligations and to navigate the legal complexities effectively. This is especially crucial in cases involving property disputes, maintenance claims, or inheritance matters.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Live-in-Relationships-in-India-Know-Your-Legal-Rights.jpg"
  },
  {
    "title": "Supreme Court Imposes Year-Long Firecracker Ban in Delhi-NCR",
    "description": "<p>The Supreme Court has imposed a comprehensive, year-long ban on the use, manufacture, sale, and storage of firecrackers in the Delhi-National Capital Region (NCR). This decision extends beyond the previous 3-4 month restrictions, aiming to address the region's persistent air quality issues.</p><p>The Court emphasized that the prevailing air pollution levels in Delhi-NCR necessitate stringent measures. Consequently, no exceptions will be made, including for 'green crackers,' which are only marginally less polluting than traditional ones. The ban also encompasses online sales of firecrackers.</p><p>In its ruling, the Court underscored the fundamental right to health under Article 21 of the Constitution, highlighting the adverse effects of air pollution on citizens' well-being. The bench stated that no religious practices advocate for activities that harm the environment or public health.</p><p>This landmark judgment reflects the judiciary's commitment to ensuring a cleaner environment and safeguarding public health in the face of escalating pollution concerns in the capital region.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme%20Court%20Imposes%20Year-Long%20Firecracker%20Ban%20in%20Delhi-NCR.jpg"
  },
  {
    "title": "Supreme Court Affirms State Commissions' Authority Over Inter-State Power Supply Affecting State Grids",
    "description": "<p>The Supreme Court has clarified that State Electricity Regulatory Commissions (SERCs) retain the authority to regulate open access to electricity transmission within their states, even when it involves inter-state power supply, if such transactions impact the state's grid.</p><p>While the Central Electricity Regulatory Commission (CERC) oversees inter-state electricity transmission under Section 79(1)(c) of the Electricity Act, 2003, this does not preclude SERCs from exercising jurisdiction over intra-state aspects of open access. Specifically, Section 42(2) empowers SERCs to ensure fair and non-discriminatory access to transmission and distribution networks within their respective states.</p><p>This ruling underscores the collaborative regulatory framework envisioned by the Electricity Act, 2003, balancing the roles of both central and state commissions in managing the nation's electricity infrastructure.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Affirms-State-Commissions-Authority-Over-Inter-State-Power-Supply-Affecting-State-Grid.jpg"
  },
  {
    "title": "Supreme Court: S-138 NI Act Complainant Not Required to Prove Financial Capacity at Threshold",
    "description": "<p>The Supreme Court has clarified that under Section 138 of the Negotiable Instruments Act, a complainant is not required to prove their financial capacity at the initial stage of the proceedings. This decision emphasizes that the focus should be on the alleged offense rather than the economic standing of the complainant.</p><p>In its ruling, the Court noted that the procedural threshold is meant to ensure that valid complaints are heard without undue burden on the complainant, thereby upholding the principles of accessible justice. This approach reinforces the idea that the legitimacy of the complaint does not hinge on the complainant’s ability to demonstrate financial robustness.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-S-138-NI-Act-Complainant-Not-Required-to-Prove-Financial-Capacity-at-Threshold.jpg"
  },
  {
    "title": "Supreme Court Upholds Cancellation of 25,753 West Bengal SSC Appointments",
    "description": "<p>The Supreme Court has upheld the Calcutta High Court's decision to invalidate approximately 25,753 teaching and non-teaching staff appointments made by the West Bengal School Service Commission (SSC) in 2016.</p><p>The Court found that the selection process was marred by widespread fraud and manipulation, rendering it irreparably tainted. Consequently, the services of the affected candidates are to be terminated, and they are required to refund any salaries received.</p><p>This ruling underscores the judiciary's commitment to maintaining integrity and transparency in public recruitment processes.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Upholds-Cancellation-of-25-753-West-Bengal-SSC-Appointments.jpg"
  },
  {
    "title": "Supreme Court Rejects Partition Suit Filed 45 Years After Property Sale",
    "description": "<p>The Supreme Court recently dismissed a partition suit that was initiated a staggering 45 years after the property's sale deed was registered.</p>  <p>The Court emphasized that the registration of a sale deed serves as a public notice, implying that any party with an interest in the property is presumed to be aware of such transactions from the date of registration. This means that the limitation period for filing claims starts from that moment.</p>  <p>In this particular case, the plaintiffs' prolonged inaction—spanning over four decades—was deemed unacceptable. The Court reiterated that, according to the law, any claims or disputes regarding property transactions should be raised within the prescribed limitation period, which, in this context, had long expired.</p>  <p>This ruling serves as a stark reminder of the importance of timely legal action in property disputes and the weight that registered documents carry as public notices.</p>",
    "image": "https://affnarayani.github.io/ninetynine_credits_legal_advice_app_content/images/Supreme-Court-Rejects-Partition-Suit-Filed-45-Years-After-Property-Sale.jpg"
  }
]